nxp-mcuxpresso/mcux-sdk-examples/frdmk28fa/demo_apps/hello_world_qspi/startup/mcuxpresso/startup_mk28fa15.c
    // Chip Level - MK28FA15
    DMA0_DMA16_IRQHandler,     // 16 : DMA channel 0,16 transfer complete
    DMA1_DMA17_IRQHandler,     // 17 : DMA channel 1,17 transfer complete
    DMA2_DMA18_IRQHandler,     // 18 : DMA channel 2,18 transfer complete
    DMA3_DMA19_IRQHandler,     // 19 : DMA channel 3,19 transfer complete
    DMA4_DMA20_IRQHandler,     // 20 : DMA channel 4,20 transfer complete
    DMA5_DMA21_IRQHandler,     // 21 : DMA channel 5,21 transfer complete
    DMA6_DMA22_IRQHandler,     // 22 : DMA channel 6,22 transfer complete
    DMA7_DMA23_IRQHandler,     // 23 : DMA channel 7,23 transfer complete
    DMA8_DMA24_IRQHandler,     // 24 : DMA channel 8,24 transfer complete
    DMA9_DMA25_IRQHandler,     // 25 : DMA channel 9,25 transfer complete
    DMA10_DMA26_IRQHandler,    // 26 : DMA channel 10,26 transfer complete
    DMA11_DMA27_IRQHandler,    // 27 : DMA channel 11,27 transfer complete
    DMA12_DMA28_IRQHandler,    // 28 : DMA channel 12,28 transfer complete
    DMA13_DMA29_IRQHandler,    // 29 : DMA channel 13,29 transfer complete
    DMA14_DMA30_IRQHandler,    // 30 : DMA channel 14,30 transfer complete
    DMA15_DMA31_IRQHandler,    // 31 : DMA channel 15,31 transfer complete
    DMA_Error_IRQHandler,      // 32 : DMA channel 0 - 31 error
    MCM_IRQHandler,            // 33 : MCM normal interrupt
    FTFE_IRQHandler,           // 34 : FTFE command complete
    Read_Collision_IRQHandler, // 35 : FTFE read collision
    LVD_LVW_IRQHandler,        // 36 : PMC controller low-voltage detect, low-voltage warning
    LLWU_IRQHandler,           // 37 : Low leakage wakeup unit
    WDOG_EWM_IRQHandler,       // 38 : Single interrupt vector for  WDOG and EWM
    TRNG0_IRQHandler,          // 39 : True randon number generator
    I2C0_IRQHandler,           // 40 : Inter-integrated circuit 0
    I2C1_IRQHandler,           // 41 : Inter-integrated circuit 1
    SPI0_IRQHandler,           // 42 : Serial peripheral Interface 0
    SPI1_IRQHandler,           // 43 : Serial peripheral Interface 1
    I2S0_Tx_IRQHandler,        // 44 : Integrated interchip sound 0 transmit interrupt
    I2S0_Rx_IRQHandler,        // 45 : Integrated interchip sound 0 receive interrupt
    LPUART0_IRQHandler,        // 46 : LPUART0 receive/transmit/error interrupt
    LPUART1_IRQHandler,        // 47 : LPUART1 receive/transmit/error interrupt
    LPUART2_IRQHandler,        // 48 : LPUART2 receive/transmit/error interrupt
    LPUART3_IRQHandler,        // 49 : LPUART3 receive/transmit/error interrupt
    LPUART4_IRQHandler,        // 50 : LPUART4 receive/transmit/error interrupt
    Reserved51_IRQHandler,     // 51 : Reserved interrupt
    Reserved52_IRQHandler,     // 52 : Reserved interrupt
    Reserved53_IRQHandler,     // 53 : Reserved interrupt
    Reserved54_IRQHandler,     // 54 : Reserved interrupt
    ADC0_IRQHandler,           // 55 : Analog-to-digital converter 0
    CMP0_IRQHandler,           // 56 : Comparator 0
    CMP1_IRQHandler,           // 57 : Comparator 1
    FTM0_IRQHandler,           // 58 : FlexTimer module 0 fault, overflow and channels interrupt
    FTM1_IRQHandler,           // 59 : FlexTimer module 1 fault, overflow and channels interrupt
    FTM2_IRQHandler,           // 60 : FlexTimer module 2 fault, overflow and channels interrupt
    CMT_IRQHandler,            // 61 : Carrier modulator transmitter
    RTC_IRQHandler,            // 62 : Real time clock
    RTC_Seconds_IRQHandler,    // 63 : Real time clock seconds
    PIT0CH0_IRQHandler,        // 64 : Periodic interrupt timer 0 channel 0
    PIT0CH1_IRQHandler,        // 65 : Periodic interrupt timer 0 channel 1
    PIT0CH2_IRQHandler,        // 66 : Periodic interrupt timer 0 channel 2
    PIT0CH3_IRQHandler,        // 67 : Periodic interrupt timer 0 channel 3
    PDB0_IRQHandler,           // 68 : Programmable delay block
    USB0_IRQHandler,           // 69 : USB OTG interrupt
    USBDCD_IRQHandler,         // 70 : USB charger detect
    Reserved71_IRQHandler,     // 71 : Reserved interrupt
    DAC0_IRQHandler,           // 72 : Digital-to-analog converter 0
    MCG_IRQHandler,            // 73 : Multipurpose clock generator
    LPTMR0_LPTMR1_IRQHandler,  // 74 : Single interrupt vector for  Low Power Timer 0 and 1
    PORTA_IRQHandler,          // 75 : Port A pin detect interrupt
    PORTB_IRQHandler,          // 76 : Port B pin detect interrupt
    PORTC_IRQHandler,          // 77 : Port C pin detect interrupt
    PORTD_IRQHandler,          // 78 : Port D pin detect interrupt
    PORTE_IRQHandler,          // 79 : Port E pin detect interrupt
    SWI_IRQHandler,            // 80 : Software interrupt
    SPI2_IRQHandler,           // 81 : Serial peripheral Interface 2
    SPI3_IRQHandler,           // 82 : Serial peripheral Interface 3
    Reserved83_IRQHandler,     // 83 : Reserved interrupt
    I2S1_Tx_IRQHandler,        // 84 : Integrated interchip sound 1 transmit interrupt
    I2S1_Rx_IRQHandler,        // 85 : Integrated interchip sound 1 receive interrupt
    FLEXIO0_IRQHandler,        // 86 : FLEXIO0
    FTM3_IRQHandler,           // 87 : FlexTimer module 3 fault, overflow and channels interrupt
    Reserved88_IRQHandler,     // 88 : Reserved interrupt
    Reserved89_IRQHandler,     // 89 : Reserved interrupt
    I2C2_IRQHandler,           // 90 : Inter-integrated circuit 2
    Reserved91_IRQHandler,     // 91 : Reserved interrupt
    Reserved92_IRQHandler,     // 92 : Reserved interrupt
    Reserved93_IRQHandler,     // 93 : Reserved interrupt
    Reserved94_IRQHandler,     // 94 : Reserved interrupt
    Reserved95_IRQHandler,     // 95 : Reserved interrupt
    Reserved96_IRQHandler,     // 96 : Reserved interrupt
    SDHC_IRQHandler,           // 97 : Secured digital host controller
    Reserved98_IRQHandler,     // 98 : Reserved interrupt
    Reserved99_IRQHandler,     // 99 : Reserved interrupt
    Reserved100_IRQHandler,    // 100: Reserved interrupt
    Reserved101_IRQHandler,    // 101: Reserved interrupt
    Reserved102_IRQHandler,    // 102: Reserved interrupt
    Reserved103_IRQHandler,    // 103: Reserved interrupt
    TPM1_IRQHandler,           // 104: TPM1 single interrupt vector for all sources
    TPM2_IRQHandler,           // 105: TPM2 single interrupt vector for all sources
    USBHSDCD_IRQHandler,       // 106: HS USB charger detect
    I2C3_IRQHandler,           // 107: Inter-integrated circuit 3
    Reserved108_IRQHandler,    // 108: Reserved interrupt
    USBHS_IRQHandler,          // 109: USB HS interrupt
    Reserved110_IRQHandler,    // 110: Reserved interrupt
    Reserved111_IRQHandler,    // 111: Reserved interrupt
    Reserved112_IRQHandler,    // 112: Reserved interrupt
    Reserved113_IRQHandler,    // 113: Reserved interrupt
    Reserved114_IRQHandler,    // 114: Reserved interrupt
    Reserved115_IRQHandler,    // 115: Reserved interrupt
    QuadSPI0_IRQHandler,       // 116: qspi
};                             /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__((section(".after_vectors.init_data"))) void data_init(unsigned int romstart,
                                                                    unsigned int start,
                                                                    unsigned int len)
{
    unsigned int *pulDest = (unsigned int *)start;
    unsigned int *pulSrc  = (unsigned int *)romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__((section(".after_vectors.init_bss"))) void bss_init(unsigned int start, unsigned int len)
{
    unsigned int *pulDest = (unsigned int *)start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__((section(".after_vectors.reset"))) void ResetISR(void)
{
    // Disable interrupts
    __asm volatile ("cpsid i");
    //
    // Copy the data sections from flash to SRAM.
    //
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

