nxp-mcuxpresso/mcux-sdk-examples/frdmk28fa/demo_apps/hello_world_qspi/startup/mcuxpresso/startup_mk28fa15.c
WEAK void SPI0_IRQHandler(void)
{
    SPI0_DriverIRQHandler();
}

WEAK void SPI1_IRQHandler(void)
{
    SPI1_DriverIRQHandler();
}

WEAK void I2S0_Tx_IRQHandler(void)
{
    I2S0_Tx_DriverIRQHandler();
}

WEAK void I2S0_Rx_IRQHandler(void)
{
    I2S0_Rx_DriverIRQHandler();
}

WEAK void LPUART0_IRQHandler(void)
{
    LPUART0_DriverIRQHandler();
}

WEAK void LPUART1_IRQHandler(void)
{
    LPUART1_DriverIRQHandler();
}

WEAK void LPUART2_IRQHandler(void)
{
    LPUART2_DriverIRQHandler();
}

WEAK void LPUART3_IRQHandler(void)
{
    LPUART3_DriverIRQHandler();
}

WEAK void LPUART4_IRQHandler(void)
{
    LPUART4_DriverIRQHandler();
}

WEAK void Reserved51_IRQHandler(void)
{
    Reserved51_DriverIRQHandler();
}

WEAK void Reserved52_IRQHandler(void)
{
    Reserved52_DriverIRQHandler();
}

WEAK void Reserved53_IRQHandler(void)
{
    Reserved53_DriverIRQHandler();
}

WEAK void Reserved54_IRQHandler(void)
{
    Reserved54_DriverIRQHandler();
}

WEAK void ADC0_IRQHandler(void)
{
    ADC0_DriverIRQHandler();
}

WEAK void CMP0_IRQHandler(void)
{
    CMP0_DriverIRQHandler();
}

WEAK void CMP1_IRQHandler(void)
{
    CMP1_DriverIRQHandler();
}

WEAK void FTM0_IRQHandler(void)
{
    FTM0_DriverIRQHandler();
}

WEAK void FTM1_IRQHandler(void)
{
    FTM1_DriverIRQHandler();
}

WEAK void FTM2_IRQHandler(void)
{
    FTM2_DriverIRQHandler();
}

WEAK void CMT_IRQHandler(void)
{
    CMT_DriverIRQHandler();
}

WEAK void RTC_IRQHandler(void)
{
    RTC_DriverIRQHandler();
}

WEAK void RTC_Seconds_IRQHandler(void)
{
    RTC_Seconds_DriverIRQHandler();
}

WEAK void PIT0CH0_IRQHandler(void)
{
    PIT0CH0_DriverIRQHandler();
}

WEAK void PIT0CH1_IRQHandler(void)
{
    PIT0CH1_DriverIRQHandler();
}

WEAK void PIT0CH2_IRQHandler(void)
{
    PIT0CH2_DriverIRQHandler();
}

WEAK void PIT0CH3_IRQHandler(void)
{
    PIT0CH3_DriverIRQHandler();
}

WEAK void PDB0_IRQHandler(void)
{
    PDB0_DriverIRQHandler();
}

WEAK void USB0_IRQHandler(void)
{
    USB0_DriverIRQHandler();
}

WEAK void USBDCD_IRQHandler(void)
{
    USBDCD_DriverIRQHandler();
}

WEAK void Reserved71_IRQHandler(void)
{
    Reserved71_DriverIRQHandler();
}

WEAK void DAC0_IRQHandler(void)
{
    DAC0_DriverIRQHandler();
}

WEAK void MCG_IRQHandler(void)
{
    MCG_DriverIRQHandler();
}

WEAK void LPTMR0_LPTMR1_IRQHandler(void)
{
    LPTMR0_LPTMR1_DriverIRQHandler();
}

WEAK void PORTA_IRQHandler(void)
{
    PORTA_DriverIRQHandler();
}

WEAK void PORTB_IRQHandler(void)
{
    PORTB_DriverIRQHandler();
}

WEAK void PORTC_IRQHandler(void)
{
    PORTC_DriverIRQHandler();
}

WEAK void PORTD_IRQHandler(void)
{
    PORTD_DriverIRQHandler();
}

WEAK void PORTE_IRQHandler(void)
{
    PORTE_DriverIRQHandler();
}

WEAK void SWI_IRQHandler(void)
{
    SWI_DriverIRQHandler();
}

WEAK void SPI2_IRQHandler(void)
{
    SPI2_DriverIRQHandler();
}

WEAK void SPI3_IRQHandler(void)
{
    SPI3_DriverIRQHandler();
}

WEAK void Reserved83_IRQHandler(void)
{
    Reserved83_DriverIRQHandler();
}

WEAK void I2S1_Tx_IRQHandler(void)
{
    I2S1_Tx_DriverIRQHandler();
}

WEAK void I2S1_Rx_IRQHandler(void)
{
    I2S1_Rx_DriverIRQHandler();
}

WEAK void FLEXIO0_IRQHandler(void)
{
    FLEXIO0_DriverIRQHandler();
}

WEAK void FTM3_IRQHandler(void)
{
    FTM3_DriverIRQHandler();
}

WEAK void Reserved88_IRQHandler(void)
{
    Reserved88_DriverIRQHandler();
}

WEAK void Reserved89_IRQHandler(void)
{
    Reserved89_DriverIRQHandler();
}

WEAK void I2C2_IRQHandler(void)
{
    I2C2_DriverIRQHandler();
}

WEAK void Reserved91_IRQHandler(void)
{
    Reserved91_DriverIRQHandler();
}

WEAK void Reserved92_IRQHandler(void)
{
    Reserved92_DriverIRQHandler();
}

WEAK void Reserved93_IRQHandler(void)
{
    Reserved93_DriverIRQHandler();
}

WEAK void Reserved94_IRQHandler(void)
{
    Reserved94_DriverIRQHandler();
}

WEAK void Reserved95_IRQHandler(void)
{
    Reserved95_DriverIRQHandler();
}

WEAK void Reserved96_IRQHandler(void)
{
    Reserved96_DriverIRQHandler();
}

WEAK void SDHC_IRQHandler(void)
{
    SDHC_DriverIRQHandler();
}

WEAK void Reserved98_IRQHandler(void)
{
    Reserved98_DriverIRQHandler();
}

WEAK void Reserved99_IRQHandler(void)
{
    Reserved99_DriverIRQHandler();
}

WEAK void Reserved100_IRQHandler(void)
{
    Reserved100_DriverIRQHandler();
}

WEAK void Reserved101_IRQHandler(void)
{
    Reserved101_DriverIRQHandler();
}

WEAK void Reserved102_IRQHandler(void)
{
    Reserved102_DriverIRQHandler();
}

WEAK void Reserved103_IRQHandler(void)
{
    Reserved103_DriverIRQHandler();
}

WEAK void TPM1_IRQHandler(void)
{
    TPM1_DriverIRQHandler();
}

WEAK void TPM2_IRQHandler(void)
{
    TPM2_DriverIRQHandler();
}

WEAK void USBHSDCD_IRQHandler(void)
{
    USBHSDCD_DriverIRQHandler();
}

WEAK void I2C3_IRQHandler(void)
{
    I2C3_DriverIRQHandler();
}

WEAK void Reserved108_IRQHandler(void)
{
    Reserved108_DriverIRQHandler();
}

WEAK void USBHS_IRQHandler(void)
{
    USBHS_DriverIRQHandler();
}

WEAK void Reserved110_IRQHandler(void)
{
    Reserved110_DriverIRQHandler();
}

WEAK void Reserved111_IRQHandler(void)
{
    Reserved111_DriverIRQHandler();
}

WEAK void Reserved112_IRQHandler(void)
{
    Reserved112_DriverIRQHandler();
}

WEAK void Reserved113_IRQHandler(void)
{
    Reserved113_DriverIRQHandler();
}

WEAK void Reserved114_IRQHandler(void)
{
    Reserved114_DriverIRQHandler();
}

WEAK void Reserved115_IRQHandler(void)
{
    Reserved115_DriverIRQHandler();
}

WEAK void QuadSPI0_IRQHandler(void)
{
    QuadSPI0_DriverIRQHandler();
}

//*****************************************************************************

#if defined(DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
